Repository: pmtzlat/StudyBuddy
Catalog: lib/l10n/app_*.arb
Languages: es

# examsTitle
source: Exams
es: Exámenes

source: Add Exam
es: Agregar Examen

source: Add
es: Agregar

# examAddedCorrectly
source: Exam added successfully!
es: ¡Examen agregado correctamente!

# errorAddingExam
source: Error adding exam. Please try again.
es: Error al agregar el examen. Por favor, inténtalo de nuevo.

source: Exam Name
es: Nombre

source: Exam Date
es: Fecha

source: Exam Weight
es: Peso del Examen

# sessionTime
source: Study time for units:
es: Tiempo de estudio para las unidades:

# revisionTime
source: Revision Study Time:
es: Tiempo por repaso:

source: hours
es: horas

source: minutes
es: minutos

# weightValidation
source: Enter a valid weight (0.0 - 2.0)
es: Ingresa un peso válido (0.0 - 2.0)

source: Add Unit
es: Agregar Unidad

source: Units
es: Unidades

# startStudy
source: Study Start Date
es: Fecha de Inicio del Estudio

# wrongDates
source: Exam has to be in the future!
es: ¡El examen debe ser en el futuro!

# errorGettingExams
source: Error getting your exams. Try again later.
es: Error al obtener tus exámenes. Inténtalo de nuevo más tarde.

# noExamsYet
source: You have no exams with exams in the future added yet! Click the button to add one.
es: ¡Aún no has agregado exámenes futuros! Haz clic en el botón para agregar uno.

source: Add Units
es: Agregar Unidades

# errorDeletingExam
source: Error deleting
es: Error al eliminar

# examDeletedCorrectly
source: deleted successfully
es: eliminado correctamente

source: Number of Units
es: Unidades

# errorGettingUnits
source: Error getting Units. try again later
es: Error al obtener Unidades. Inténtalo de nuevo más tarde

# noUnitsYet
source: You have no units added yet! Click the button to add one.
es: ¡Aún no has agregado unidades! Haz clic en el botón para agregar una.

source: Unit Name
es: Nombre de la Unidad

# unitHours
source: Hours to study unit
es: Horas para estudiar la unidad

# orderMatters
source: Unit order matters when studying
es: El orden de las unidades importa

# numberOfRevisions
source: Number of revision days
es: Sesiones de repaso

source: Error editing unit
es: Error al editar la unidad

# errorEditingExam
source: Error editing exam. Units or revisions may be altered.
es: Error al editar el examen. Las unidades o revisiones pueden estar alteradas.

# isUnitCompleted
source: Has this unit been studied already?
es: ¿Se ha estudiado esta unidad ya?

# unitCompleted
source: This unit has been already studied.
es: Esta unidad ya ha sido estudiada.

# unitNotCompleted
source: This unit has not been studied yet.
es: Esta unidad aún no ha sido estudiada.

# futureExams
source: Future
es: Futuros

# pastExams
source: Past
es: Pasados

# intValidator
source: Integers only
es: Solo enteros

# applySessionTime
source: Apply session time to all units
es: Aplicar tiempo de sesión a todas las unidades

# continueOn
source: Continue
es: Continuar

# enterUnitSessionTime
source: Enter the time you want to spend on each unit. You can also change the units' names.
es: Ingresa el tiempo que deseas dedicar a cada unidad. También puedes cambiar los nombres de las unidades.

source: Next
es: Siguiente

# prioritizeExams
source: Please move the following exams in order of priority (highest priority on top).
es: Por favor, mueve los siguientes exámenes en orden de prioridad (máxima prioridad arriba).

source: Delete
es: Eliminar

# prioritizeButton
source: Prioritize
es: Priorizar

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

# reorderText
source: Drag and drop to move your exams in order of importance (highest first)
es: Arrastra y suelta para cambiar la importancia de tus exámenes (el más importante primero)

# errorPrioritizing
source: Error reordering exams
es: Error al reorganizar los exámenes

# color
source: Exam Color:
es: Color:

source: Select
es: Seleccionar

source: Choose Color
es: Seleccionar Color

source: Edit
es: Editar

source: Priority
es: Prioridad

source: Time Studied:
es: Tiempo estudiado:

# orderMatter
source: Order Matters:
es: Orden importa:

source: Complete
es: Completar

source: Yes
es: Sí

source: Days Until Exam:
es: Días hasta el examen:

source: Revision Days
es: Días de repaso

source: Loading...
es: Cargando...

source: Completed:
es: Completado:

source: Swipe to delete
es: Desliza para eliminar

# defaultStudyTime
source: Default study time for each unit:
es: Tiempo de estudio predeterminado por unidad:

# completeTrue
source: Complete!
es: ¡Completado!

source: Error loading exams!
es: Error al cargar los exámenes!

source: Unit
es: Unidad

# sessionSplittable
source: Split study sessions if they don't fit in a day
es: Dividir las sesiones de estudio si no caben en un mismo día

# keepSessionsInDay
source: Study sessions can be split:
es: Dividir sesiones de estudio:

source: Session time can't be zero!
es: ¡El tiempo de sesión no puede ser cero!

source: Exam
es: Examen

# calendarTitle
source: Calendar
es: Calendario

# configureCalendar
source: Start configuring Calendar!
es: ¡Comienza a configurar el Calendario!

# chooseFreeSchedule
source: Choose at what times you can study:
es: Elige en qué momentos puedes estudiar:

# needsRecalculation
source: Update schedule
es: Actualizar plan

# needsRecalculationInfo
source: You have made unsaved changes that affect your schedule. Please update your plan again.
es: Has realizado cambios no guardados que afectan tu plan. Por favor, actualiza tu plan.

source: Monday
es: Lunes

source: Tuesday
es: Martes

source: Wednesday
es: Miércoles

source: Thursday
es: Jueves

source: Friday
es: Viernes

source: Saturday
es: Sábado

source: Sunday
es: Domingo

source: Next Day
es: Día Siguiente

source: Calculate Plan
es: Calcular Plan

source: Loading Schedule...
es: Cargando Horario...

source: Change Availability
es: Cambiar Disponibilidad

source: Try Again
es: Intentar de Nuevo

# inactiveCalendar
source: You need to have exams to have an active calendar!
es: ¡Necesitas tener exámenes para tener un calendario activo!

# errorDeletingGap
source: Error deleting time gap!
es: Error al eliminar el espacio de tiempo!

source: Add Gap
es: Agregar Espacio

# errorAddingGap
source: Error adding Time Gap!
es: Error al agregar Espacio de Tiempo!

# wrongInputGap
source: The start must be before the end!
es: El inicio debe ser antes del final!

# editCustomDays
source: Your days with a custom availability:
es: Tus días con disponibilidad personalizada:

# customDays
source: Your custom days (in the future)
es: Tus días personalizados (en el futuro)

# addCustomDay
source: Add Custom Schedule for Day
es: Agregar Horario Personalizado para el Día

source: Day
es: Día

source: Error Adding Custom Day
es: Error al agregar Día Personalizado

source: Error deleting custom day!
es: Error al eliminar el día personalizado!

# customDayDuplicate
source: That day has already been created!
es: ¡Ese día ya ha sido creado!

# customDayEmpty
source: You didn't add anything to that day!
es: ¡No agregaste nada a ese día!

# noTimeSlotsInDay
source: Free time!
es: ¡Tiempo libre!

# recalculationSuccessful
source: New schedule created!
es: ¡Nuevo horario creado!

# recalcErrorBody
source: There was an error recalculating your schedule. Try again later.
es: Hubo un error al recalcular tu horario. Intenta de nuevo más tarde.

# recalcNoTimeTitle
source: No time!
es: ¡Sin tiempo!

# recalcNoTimeBody
source: Based on your availability, the days left until your exams, and the amount of time you want to dedicate to each topic/exam, there is not enough time to study everything. You can reduce the session time or the number of revision days for some exams, or change your availablity to suit your needs. These are the exams that didn't have any space left:
es: Según tu disponibilidad, los días restantes hasta tus exámenes y la cantidad de tiempo que deseas dedicar a cada tema/examen, no hay suficiente tiempo para estudiar todo. Puedes reducir el tiempo de sesión o el número de días de repaso para algunos exámenes, o cambiar tu disponibilidad según tus necesidades. Estos son los exámenes que no tienen espacio disponible:

# completePreviousDaysTitle
source: Mark previous days as complete?
es: ¿Marcar días anteriores como completados?

# completePreviousDaysDesc
source: There are past days that have study sessions which are not marked as complete. Do you want to mark them as complete? If you don't want to mark them as complete, you can leave them as incomplete and recalculate a new schedule including them.
es: Hay días pasados que tienen sesiones de estudio que no están marcadas como completas. ¿Quieres marcarlas como completas? Si no quieres marcarlas como completas, puedes dejarlas como incompletas y recalcular un nuevo horario que las incluya.

# leaveAsIs
source: Leave them
es: Déjalos

source: Update Plan
es: Actualizar Plan

source: Mark as complete
es: Marcar como completas

# keepOrRecalc
source: You have decided to leave some sessions incomplete. Do you want to recalculate a new schedule to include the missed sessions?
es: Has decidido dejar algunas sesiones incompletas. ¿Quieres recalcular un nuevo horario para incluir las sesiones perdidas?

# keep
source: Leave incomplete
es: Dejar incompleto

# recalc
source: Recalculate
es: Recalcular

# editUnitCompletionInExamsPage
source: If you want to change as past session's completeness, you can edit that exam's units in the 'Exams' , and then recalculate the plan to include your changes.
es: Si deseas cambiar la completitud de sesiones pasadas, puedes editar las unidades de ese examen en 'Exámenes' y luego recalcular el plan para incluir tus cambios.

# cantStartSessionForFuture
source: You can't start studying for a day that is not today
es: No puedes empezar a estudiar para un día que no es hoy

source: View Month
es: Ver Mes

# swipeForNextDay
source: Change day
es: Cambiar día

# errorChangingTimeSlotCompletion
source: Error updating Time Slot
es: Error al actualizar la sesión de estudio

source: Error loading day!
es: Error al cargar el día!

source: Reload
es: Recargar

source: Open Calendar
es: Abrir Calendario

# availabilityForSpecificDays
source: Customize specific days
es: Personalizar días específicos

source: Nothing here yet!
es: ¡Todavía no hay nada aquí!

# backToWeeklyAvailability
source: Back to weekly view
es: Volver a vista semanal

source: Busy
es: Ocupado

source: Reset to default
es: Cambiar a predeterminado

source: Error resetting to default!
es: Error al restablecer a predeterminado!

# error
source: An error occurred. Try again later
es: Ocurrió un error. Inténtalo de nuevo más tarde

# progressTitle
source: Progress
es: Progreso

# timerTitle
source: Timer
es: Temporizador

source: Start
es: Comenzar

source: Stop
es: Detener

source: Reset
es: Reiniciar

source: Session Completed
es: Sesión Completada

# sessionCompletedBody
source: You have completed your goal for this session! Do you want to continue, or mark the session as complete?
es: ¡Has completado tu objetivo para esta sesión! ¿Quieres continuar o marcar la sesión como completa?

# continueTimer
source: Continue
es: Continuar

# completeSession
source: Complete
es: Completar

# dontCloseApp
source: If the app is closed, the timer will stop ;)
es: Si cierras la aplicación, el temporizador se detendrá ;)

# hoursCapitalized
source: Hours
es: Horas

# minutesCapitalized
source: Minutes
es: Minutos

# secondsCapitalized
source: Seconds
es: Segundos

source: Goal
es: Objetivo

source: Error Saving!
es: Error al guardar!

source: Log Out
es: Cerrar Sesión

# desyncMsg
source: Please use the real, correct date in your device for the App to work properly!
es: ¡Utiliza la fecha real y correcta en tu dispositivo para que la aplicación funcione correctamente!

source: Warning
es: Advertencia

# noConnectionMsg
source: No internet connection detected. Please restart the application with an internet connection.
es: No se detectó conexión a Internet. Reinicia la aplicación con conexión a Internet.

source: Error loading!
es: Error al cargar!
